export const base = "http://localhost:3080"; // while testing we add local address to requests
//export const base = ""; // while testing we add local address to requests

  export const woodColumns = [
    "key",
    "מקט פנימי", // Start - one -1
    "תת קטגוריה",
    "מבנה החומר",
    "שם החומר",
    "עובי",
    "עובי בממ", // End - six - 6
    "שיטת חישוב",
    "דרך חישוב",
    "מחיר יחידה",
    "מחיר יחידה בשח",
    "ספק",
    "תאריך עדכון",
    "הערות"
  ];

  export const testingWoodData = [ // FOR TESTING THE TABLE !
    {
      key: '1',                 // _id of document in database (MongoDB)
      "מקט פנימי": "e1",
      "תת קטגוריה": "עץ גושני",
      "מבנה החומר": "גזום",
      "שם החומר": "מייפל",
      "עובי": "1.5 אינץ",
      "עובי בממ": "30",
      "שיטת חישוב": "לקוב",
      "דרך חישוב": "",
      "מחיר יחידה": "לקוב",
      "מחיר יחידה בשח": "800",
      "ספק": "גרוס",
      "תאריך עדכון": "6/5/2019",
      "הערות": ""
    },
    {
        key: '2',                 // _id of document in database (MongoDB)
        "מקט פנימי": "e2",
        "תת קטגוריה": "למי",
        "מבנה החומר": "טבעי",
        "שם החומר": "בוק",
        "עובי": "3 אינץ",
        "עובי בממ": "60",
        "שיטת חישוב": "למר",
        "דרך חישוב": "",
        "מחיר יחידה": "למר",
        "מחיר יחידה בשח": "1000",
        "ספק": "אברבוך",
        "תאריך עדכון": "",
        "הערות": ""
      },
      {
        key: '3',                 // _id of document in database (MongoDB)
        "מקט פנימי": "e3",
        "תת קטגוריה": "עץ דן",
        "מבנה החומר": "חד",
        "שם החומר": "בוק",
        "עובי": "6 אינץ",
        "עובי בממ": "20",
        "שיטת חישוב": "למר",
        "דרך חישוב": "",
        "מחיר יחידה": "למר",
        "מחיר יחידה בשח": "500",
        "ספק": "מני",
        "תאריך עדכון": "",
        "הערות": ""
      },    {
        key: '4',                 // _id of document in database (MongoDB)
        "מקט פנימי": "e4",
        "תת קטגוריה": "אורן",
        "מבנה החומר": "עשוי",
        "שם החומר": "בוק",
        "עובי": "5",
        "עובי בממ": "220",
        "שיטת חישוב": "למר",
        "דרך חישוב": "",
        "מחיר יחידה": "למר",
        "מחיר יחידה בשח": "230",
        "ספק": "בוקר עצים",
        "תאריך עדכון": "",
        "הערות": ""
      }
    ]

    export const plywoodColumns = [
      "key",
      "מקט פנימי",
      "תת קטגוריה",
      "סוג",
      "תת סוג",
      "סוג משנה",
      "ציפוי",
      "שיטת חישוב",
      "מידות",
      "מחיר יחידה",
      "ספק",
      "תאריך עדכון",
      "הערות"
    ];

  export const testingPlywoodData = [ // FOR TESTING THE TABLE !
    {
      key: '1',                 // _id of document in database (MongoDB)
      "מקט פנימי": "l1",
      "תת קטגוריה": "סנדוויץ",
      "סוג": "סיני",
      "תת סוג": "גלוי",
      "סוג משנה": "גב",
      "ציפוי": "כחול",
      "שיטת חישוב": "ליחידה",
      "מידות": "100x20",
      "מחיר יחידה": "150",
      "ספק": "מי השרון",
      "תאריך עדכון": "",
      "הערות": ""
    },
    {
        key: '2',                 // _id of document in database (MongoDB)
        "מקט פנימי": "l2",
        "תת קטגוריה": "טווין",
        "סוג": "כרמיאל",
        "תת סוג": "צד 2",
        "סוג משנה": "פורניר",
        "ציפוי": "חום568",
        "שיטת חישוב": "ליחידה",
        "מידות": "50x60",
        "מחיר יחידה": "200",
        "ספק": "לבידי זהב",
        "תאריך עדכון": "",
        "הערות": ""
      }
    ]

    export const affixingColumns = [
      "key",
      "מקט פנימי",
      "תת קטגוריה",
      "סוג",
      "חברה",
      "סוג משנה",
      "גימור",
      "מידות",
      "משקל",
      "שיטת חישוב",
      "מחיר יחידה",
      "ספק",
      "מקט ספק",
      "דגם",
      "תאריך עדכון",
      "הערות"
    ];

export const testingAffixingData = [ // FOR TESTING THE TABLE !
  {
    key: '1',                 // _id of document in database (MongoDB)
    "מקט פנימי": "p1",
    "תת קטגוריה": "ידית",
    "סוג": "ברונזה",
    "חברה": "בלורן",
    "סוג משנה": "ציפוי",
    "גימור": "לבן",
    "מידות": "32",
    "משקל": "",
    "שיטת חישוב": "100",
    "מחיר יחידה": "125",
    "ספק": "מועלם",
    "מקט ספק": "K258",
    "דגם": "",
    "תאריך עדכון": "3/10/2020",
    "הערות": "אין"
  },
  {
      key: '2',                 // _id of document in database (MongoDB)
      "מקט פנימי": "p2",
      "תת קטגוריה": "כרוסלה",
      "סוג": "פלסטיק",
      "חברה": "סנקו",
      "סוג משנה": "עגולה",
      "גימור": "נירוסטה",
      "מידות": "60",
      "משקל": "",
      "שיטת חישוב": "1000",
      "מחיר יחידה": "200",
      "ספק": "חג",
      "מקט ספק": "495561",
      "דגם": "שבלול",
      "תאריך עדכון": "7/5/2020",
      "הערות": ""
    }
  ]

  export const dataColumns = [
    "key",
    "שם",
    "חפ",
    "רחוב",
    "עיר",
    "מיקוד",
    "תד",
    "טלפון",
    "פלאפון",
    "פקס",
    "מייל",
    "סוג פעילות",
    "הערות"
  ];

export const testingData = [ // FOR TESTING THE TABLE ! - Clients / Suppliers / Manufacturers
    {
      key: '1',                 // _id of document in database (MongoDB)
      "שם": "יהושע רבינוביץ",
      "חפ": "19485623",
      "רחוב": "לוחמי הלימים 56",
      "עיר": "חולון",
      "מיקוד": "19486",
      "תד": "1652",
      "טלפון": "03-6498164",
      "פלאפון": "053-1948653",
      "פקס": "02-1948653",
      "מייל": "yehosha@gmail.com",
      "סוג פעילות": "משווק איזורי",
      "הערות": "יש לקבוע פגישה בעניין בניית חדר ישיבות גדול"
    },
    {
        key: '2',                 // _id of document in database (MongoDB)
        "שם": "מיכה שימשבילי",
        "חפ": "4985135",
        "רחוב": "בולמי הזעזועים 56",
        "עיר": "רעננה",
        "מיקוד": "49865",
        "תד": "2983",
        "טלפון": "03-63563456",
        "פלאפון": "053-2345234",
        "פקס": "06-8767554",
        "מייל": "micha@gmail.com",
        "סוג פעילות": "ליצן החצר",
        "הערות": "צריך לברר למה לא מצליח להצחיק מספיק טוב את הילדים"
      },
      {
        key: '3',                 // _id of document in database (MongoDB)
        "שם": "רפי גרינברג",
        "חפ": "78245897",
        "רחוב": "החצר 12",
        "עיר": "אילת",
        "מיקוד": "97866",
        "תד": "3423",
        "טלפון": "08-78467456",
        "פלאפון": "051-3453245",
        "פקס": "02-1212434",
        "מייל": "raphi@gmail.com",
        "סוג פעילות": "יהלומן",
        "הערות": "אין"
      },
      {
        key: '4',                 // _id of document in database (MongoDB)
        "שם": "רפי גרינברג",
        "חפ": "78245897",
        "רחוב": "החצר 12",
        "עיר": "אילת",
        "מיקוד": "97866",
        "תד": "3423",
        "טלפון": "08-78467456",
        "פלאפון": "051-3453245",
        "פקס": "02-1212434",
        "מייל": "raphi@gmail.com",
        "סוג פעילות": "יהלומן",
        "הערות": "אין"
      },
      {
        key: '5',                 // _id of document in database (MongoDB)
        "שם": "רפי גרינברג",
        "חפ": "78245897",
        "רחוב": "החצר 12",
        "עיר": "אילת",
        "מיקוד": "97866",
        "תד": "3423",
        "טלפון": "08-78467456",
        "פלאפון": "051-3453245",
        "פקס": "02-1212434",
        "מייל": "raphi@gmail.com",
        "סוג פעילות": "יהלומן",
        "הערות": "אין"
      },
      {
        key: '6',                 // _id of document in database (MongoDB)
        "שם": "רפי גרינברג",
        "חפ": "78245897",
        "רחוב": "החצר 12",
        "עיר": "אילת",
        "מיקוד": "97866",
        "תד": "3423",
        "טלפון": "08-78467456",
        "פלאפון": "051-3453245",
        "פקס": "02-1212434",
        "מייל": "raphi@gmail.com",
        "סוג פעילות": "יהלומן",
        "הערות": "אין"
      },
      {
        key: '7',                 // _id of document in database (MongoDB)
        "שם": "רפי גרינברג",
        "חפ": "78245897",
        "רחוב": "החצר 12",
        "עיר": "אילת",
        "מיקוד": "97866",
        "תד": "3423",
        "טלפון": "08-78467456",
        "פלאפון": "051-3453245",
        "פקס": "02-1212434",
        "מייל": "raphi@gmail.com",
        "סוג פעילות": "יהלומן",
        "הערות": "אין"
      },
      {
        key: '8',                 // _id of document in database (MongoDB)
        "שם": "רפי גרינברג",
        "חפ": "78245897",
        "רחוב": "החצר 12",
        "עיר": "אילת",
        "מיקוד": "97866",
        "תד": "3423",
        "טלפון": "08-78467456",
        "פלאפון": "051-3453245",
        "פקס": "02-1212434",
        "מייל": "raphi@gmail.com",
        "סוג פעילות": "יהלומן",
        "הערות": "אין"
      },
      {
        key: '9',                 // _id of document in database (MongoDB)
        "שם": "רפי גרינברג",
        "חפ": "78245897",
        "רחוב": "החצר 12",
        "עיר": "אילת",
        "מיקוד": "97866",
        "תד": "3423",
        "טלפון": "08-78467456",
        "פלאפון": "051-3453245",
        "פקס": "02-1212434",
        "מייל": "raphi@gmail.com",
        "סוג פעילות": "יהלומן",
        "הערות": "אין"
      },
      {
        key: '10',                 // _id of document in database (MongoDB)
        "שם": "רפי גרינברג",
        "חפ": "78245897",
        "רחוב": "החצר 12",
        "עיר": "אילת",
        "מיקוד": "97866",
        "תד": "3423",
        "טלפון": "08-78467456",
        "פלאפון": "051-3453245",
        "פקס": "02-1212434",
        "מייל": "raphi@gmail.com",
        "סוג פעילות": "יהלומן",
        "הערות": "אין"
      },
      {
        key: '11',                 // _id of document in database (MongoDB)
        "שם": "רפי גרינברג",
        "חפ": "78245897",
        "רחוב": "החצר 12",
        "עיר": "אילת",
        "מיקוד": "97866",
        "תד": "3423",
        "טלפון": "08-78467456",
        "פלאפון": "051-3453245",
        "פקס": "02-1212434",
        "מייל": "raphi@gmail.com",
        "סוג פעילות": "יהלומן",
        "הערות": "אין"
      },
      {
        key: '12',                 // _id of document in database (MongoDB)
        "שם": "רפי גרינברג",
        "חפ": "78245897",
        "רחוב": "החצר 12",
        "עיר": "אילת",
        "מיקוד": "97866",
        "תד": "3423",
        "טלפון": "08-78467456",
        "פלאפון": "051-3453245",
        "פקס": "02-1212434",
        "מייל": "raphi@gmail.com",
        "סוג פעילות": "יהלומן",
        "הערות": "אין"
      },
      {
        key: '13',                 // _id of document in database (MongoDB)
        "שם": "רפי גרינברג",
        "חפ": "78245897",
        "רחוב": "החצר 12",
        "עיר": "אילת",
        "מיקוד": "97866",
        "תד": "3423",
        "טלפון": "08-78467456",
        "פלאפון": "051-3453245",
        "פקס": "02-1212434",
        "מייל": "raphi@gmail.com",
        "סוג פעילות": "יהלומן",
        "הערות": "אין"
      },
  ];



